Repository: Health-Project-Y3/frontend
Catalog: thurula/lib/l10n/intl_*.arb
Languages: si

# appTitle
source: Thurula
si: තුරුල

source: Back
si: ආපසු යන්න

source: Next
si: ඊළඟ

source: Save
si: සුරකින්න

source: Cancel
si: අවලංගු කරන්න

# login_page_username
source: Username
si: පරිශීලක නාමය

# login_page_password
source: Password
si: මුරපදය

# login_page_login_button
source: Login
si: ඇතුල් වන්න

# login_page_register
source: Register
si: ලියාපදිංචි වන්න

# login_page_noAccountQuestion
source: Don't have an account?
si: ගිණුමක් නැතිනම්?

# login_page_usernamePrompt
source: Please enter your username
si: ඔබේ පරිශීලක නාමය ඇතුළත් කරන්න

# login_page_passwordPrompt
source: Please enter your password
si: ඔබේ මුරපදය ඇතුළත් කරන්න

# login_page_InvalidCredentials
source: Invalid Credentials
si: වලංගු නොවන සහතික

# login_page_EmptyInputPrompt
source: Please fill input
si: කරුණාකර පූරණය කරන්න

# welcome_page_Caption1
source: New Life, Tiny Steps
si: නව ජීවිතය, කුඩා පියවර

# welcome_page_Caption2
source: We just need a few quick answers from you to personalize your experience
si: ඔබේ අත්දැකීම් පුද්ගලීකරණය කිරීම සඳහා අපට ඔබෙන් ඉක්මන් පිළිතුරු කිහිපයක් අවශ්යි

# welcome_page_GetStartedButton
source: Get Started
si: පටන් ගන්න

# welcome_page_AlreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තියෙනවද?

# welcome_page_SignIn
source: Sign In
si: ලොග් වන්න

# register_page_FirstName
source: First Name
si: මුල් නම

# register_page_LastName
source: Last Name
si: වාසගම

# register_page_Email
source: Email
si: ඊමේල් ලිපිනය

# register_page_PasswordConfirm
source: Confirm Password
si: මුරපදය තහවුරු කරන්න

# register_page_UsernameTakenError
source: Sorry, this username is already taken
si: කණගාටුයි, මෙම පරිශීලක නාමය දැනටමත් ලබාගෙන ඇත

# register_page_InvalidError
source: Invalid
si: අවලංගුයි

# register_page_ToastError
source: Something went wrong, please try again
si: මොකක් හරි වැරදුනා, කරුණාකර නැවත උත්සාහ කරන්න

# register_page2_Q1
source: I am currently pregnant
si: මම දැන් ගැබිනියක්

# register_page2_Q2
source: I am a new parent
si: මම අලුත් මවක්

# register_page3_Q1
source: When was your baby born?
si: ඔබේ දරුවා ඉපදුණේ කවදාද?

# register_page3_Q2
source: What is the gender of your baby?
si: ඔබේ දරුවාගේ ලිංගය කුමක්ද?

# register_page3_Q1placeholder
source: Enter Baby's Birthday
si: දරුවාගේ උපන් දිනය

# register_page3_Q2placeholder
source: Enter your baby's name
si: දරුවාගේ නම

# register_page3_Male
source: Male
si: පිරිමි

# register_page3_Female
source: Female
si: ගැහැනු

# register_page4_C1
source: Do you know your baby's due date?
si: ඔබේ දරුවාගේ නියමිත දිනය දන්නවාද?

# register_page4_C2
source: Enter due date given by doctor
si: වෛද්‍යවරයා විසින් දෙන ලද නියමිත දිනය

# register_page4_Q1
source: Enter Due Date
si: නියමිත දිනය ඇතුළත් කරන්න

# register_page4_OR
source: OR
si: හෝ

# register_page4_C3
source: Calculate your due date
si: ඔබේ නියමිත දිනය ගණනය කරන්න

# register_page4_C4
source: Enter the day of your last period
si: ඔබේ අවසාන ඔසප් වීමේ දිනය ඇතුළත් කරන්න

# register_page4_Q2
source: Enter Last Period Date
si: අවසාන ඔසප් වීමේ දිනය

source: Home Page
si: ප්‍රධාන පිටුව

source: Profile
si: පැතිකඩ

source: Settings
si: සැකසුම්

source: Notifications
si: දැනුම් දීම

source: Child Care Tips
si: ලාමා පිරිසිදු කිරීම සඳහා ඉඟි
